### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:24",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:20" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:20/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "20" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "20" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6105003180040938258" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691885756064529000" -> "1691886427960616200"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:24" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-13T00:16:54.182+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:24" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/f48371bb1951f31dad39ca1e9f1fcc8ca9208d0f7abe57ca6d67d44ede77173a.zip" -> "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.zip"
!       s3_object_version           = "e_qSb6SY7HLazqDoFe8.X0Jk4ZuN1HJG" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "kAQVVz0IEMTrR1wE7//d7YKQFhdtP9jnOXwfiCpJ6DI=" -> (known after apply)
!       source_code_size            = 26185788 -> (known after apply)
!       version                     = "24" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "8f6b2ae5f7a797f92f5f1ed0f2a54baa-5" -> (known after apply)
!       id                     = "builds/f48371bb1951f31dad39ca1e9f1fcc8ca9208d0f7abe57ca6d67d44ede77173a.zip" -> (known after apply)
!       key                    = "builds/f48371bb1951f31dad39ca1e9f1fcc8ca9208d0f7abe57ca6d67d44ede77173a.zip" -> "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/f48371bb1951f31dad39ca1e9f1fcc8ca9208d0f7abe57ca6d67d44ede77173a.zip" -> "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "e_qSb6SY7HLazqDoFe8.X0Jk4ZuN1HJG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6287564983122185401" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/f48371bb1951f31dad39ca1e9f1fcc8ca9208d0f7abe57ca6d67d44ede77173a.zip" -> "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.zip"
!           "timestamp" = "1691885757564033000" -> "1691886429473860000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "4173721955880494267" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/f48371bb1951f31dad39ca1e9f1fcc8ca9208d0f7abe57ca6d67d44ede77173a.zip" -> "builds/9a08bbd3afd9a3084d889326b12d2ef13cd7270c56337600d09f061a4e0ef454.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.
```
</details>